# StairstypeCalcRuleRiserMultiplier Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeCalcRuleRiserMultiplier Property
ParameterTypeId Class See Also
---
"Riser Multiplier": Calculation Rule Riser Multiplier
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeCalcRuleRiserMultiplier { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeCalcRuleRiserMultiplier As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeCalcRuleRiserMultiplier {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace